In [1]:
print("Hello World")
print("Samar Abbas")

Hello World
Samar Abbas

#First Program
-hello world
-my name

In [2]:
import pandas as pd
import numpy as np

In [3]:
print(pd)

<module 'pandas' from 'C:\\Users\\HP\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\pandas\\__init__.py'>

In [4]:
2+2

4

In [5]:
2==2

True

In [6]:
dict1={
    "Name":['Samar', 'Athar','Kaif','Shahwaiz','Faheem','Ashkar','Akbar'],
    "Marks":[99,98,97,95,90,89,90],
    "City":['Roorkee','Kannauj','Aligarh','Lucknow','Barabanki','Bihar','Moradabad']
}

In [7]:
df=pd.DataFrame(dict1)

In [8]:
df

       Name  Marks       City
0     Samar     99    Roorkee
1     Athar     98    Kannauj
2      Kaif     97    Aligarh
3  Shahwaiz     95    Lucknow
4    Faheem     90  Barabanki
5    Ashkar     89      Bihar
6     Akbar     90  Moradabad

In [9]:
df.to_csv("Friends.csv")

In [10]:
df.to_csv("Friends_Without_Index.csv",index=False)

In [11]:
df.head(2)

    Name  Marks     City
0  Samar     99  Roorkee
1  Athar     98  Kannauj

In [12]:
df.tail(3)

     Name  Marks       City
4  Faheem     90  Barabanki
5  Ashkar     89      Bihar
6   Akbar     90  Moradabad

In [13]:
df.describe()

           Marks
count   7.000000
mean   94.000000
std     4.242641
min    89.000000
25%    90.000000
50%    95.000000
75%    97.500000
max    99.000000

In [14]:
df = pd.read_csv('Friends.csv')

In [15]:
df

   Unnamed: 0      Name  Marks       City
0           0     Samar     99    Roorkee
1           1     Athar     98    Kannauj
2           2      Kaif     97    Aligarh
3           3  Shahwaiz     95    Lucknow
4           4    Faheem     90  Barabanki
5           5    Ashkar     89      Bihar
6           6     Akbar     90  Moradabad

In [16]:
df['Name'][2]

'Kaif'

In [17]:
df['Name'][2]="Sarfraz"

C:\Users\HP\AppData\Local\Temp\ipykernel_24660\3220490797.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Name'][2]="Sarfraz"
C:\Users\HP\AppData\Local\Temp\ipykernel_24660\3220490797.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]="Sarfraz"

In [18]:
df

   Unnamed: 0      Name  Marks       City
0           0     Samar     99    Roorkee
1           1     Athar     98    Kannauj
2           2   Sarfraz     97    Aligarh
3           3  Shahwaiz     95    Lucknow
4           4    Faheem     90  Barabanki
5           5    Ashkar     89      Bihar
6           6     Akbar     90  Moradabad

In [19]:
df.index['one','two','three','fourth','fifth','six','seven']

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [ ]:
df

In [ ]:
df.index['one','two','three','fourth','fifth','six','seven']

In [ ]:
rows_to_select = ['one', 'two', 'three', 'fourth', 'fifth', 'six', 'seven']
selected_rows = df.iloc[[df.index.get_loc(row) for row in rows_to_select]]

In [ ]:
df

In [ ]:
import numpy as np

In [ ]:
ser=pd.Series(np.random.rand(12))

In [4]:
ser

NameError: name 'ser' is not defined

In [5]:
type(ser)

NameError: name 'ser' is not defined

In [ ]:
ser.describe()

In [ ]:
newSeries=pd.DataFrame(np.random.rand(100,7),index.arange(100))

In [2]:
newSeries.head(10)

NameError: name 'newSeries' is not defined